<a href="https://colab.research.google.com/github/FreddyMLS/PIS/blob/main/PIS2(AUD).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Import packages

In [17]:
import pandas as pd
import numpy as np
from IPython.display import display

# data import

In [18]:
data = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/glass/glass.data', header = None)
data.head(3)

   0        1      2     3     4      5     6     7    8    9   10
0   1  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0   1
1   2  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0   1
2   3  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0   1

In [19]:
names = ['Id', 'Ri','Na','Mg','Al', 'Si', 'K', 'Ca', 'Ba', 'Fe', 'Class']
data.columns = names
data = data.drop(columns=['Id'])
data.head(3)

        Ri     Na    Mg    Al     Si     K    Ca   Ba   Fe  Class
0  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0      1
1  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0      1
2  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0      1

In [20]:
data['Class'].replace ({
   1: 'building_windows_float_processed',
   2: 'building_windows_non_float_processed',
   3: 'vehicle_windows_float_processed',
   4: 'vehicle_windows_non_float_processed (none in this database)',
   5: 'containers',
   6: 'tableware',
   7: 'headlamps'
   }, inplace=True)
data.head(3)

        Ri     Na    Mg    Al  ...    Ca   Ba   Fe                             Class
0  1.52101  13.64  4.49  1.10  ...  8.75  0.0  0.0  building_windows_float_processed
1  1.51761  13.89  3.60  1.36  ...  7.83  0.0  0.0  building_windows_float_processed
2  1.51618  13.53  3.55  1.54  ...  7.78  0.0  0.0  building_windows_float_processed

[3 rows x 10 columns]

In [21]:
for col in data.columns:
  fr = np.random.randint(5, 10)/100
  data.loc[data.sample(frac=fr).index, col] = np.nan #замена пропусков на нулевые значения
data.head(3)

        Ri     Na    Mg    Al  ...    Ca   Ba   Fe                             Class
0  1.52101  13.64  4.49  1.10  ...  8.75  0.0  0.0  building_windows_float_processed
1      NaN  13.89  3.60  1.36  ...  7.83  0.0  NaN  building_windows_float_processed
2  1.51618  13.53  3.55  1.54  ...  7.78  0.0  0.0  building_windows_float_processed

[3 rows x 10 columns]

In [22]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 214 entries, 0 to 213
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Ri      201 non-null    float64
 1   Na      195 non-null    float64
 2   Mg      203 non-null    float64
 3   Al      195 non-null    float64
 4   Si      201 non-null    float64
 5   K       203 non-null    float64
 6   Ca      203 non-null    float64
 7   Ba      195 non-null    float64
 8   Fe      201 non-null    float64
 9   Class   199 non-null    object
dtypes: float64(9), object(1)
memory usage: 16.8+ KB

In [23]:
data.describe()

               Ri          Na          Mg  ...          Ca          Ba          Fe
count  201.000000  195.000000  203.000000  ...  203.000000  195.000000  201.000000
mean     1.518348   13.401949    2.634877  ...    8.913399    0.169897    0.056567
std      0.003083    0.819446    1.464252  ...    1.375803    0.486563    0.096719
min      1.511150   10.730000    0.000000  ...    5.430000    0.000000    0.000000
25%      1.516460   12.895000    1.840000  ...    8.240000    0.000000    0.000000
50%      1.517680   13.300000    3.480000  ...    8.600000    0.000000    0.000000
75%      1.519160   13.805000    3.595000  ...    9.140000    0.000000    0.100000
max      1.533930   17.380000    4.490000  ...   16.190000    3.150000    0.510000

[8 rows x 9 columns]

In [27]:
display(data["Class"].describe())
print("==================================")
display(data["Class"].value_counts())

count                                      199
unique                                       6
top       building_windows_non_float_processed
freq                                        69
Name: Class, dtype: object

==================================

building_windows_non_float_processed    69
building_windows_float_processed        65
headlamps                               27
vehicle_windows_float_processed         16
containers                              13
tableware                                9
Name: Class, dtype: int64